{
  "data":[
    {"title":"@onAnycreate",
  "concept":"A shout that is sent to all bots when a bot is created. Sent immediately after @onCreate is sent."},
    {"title":"@onAnyBotClicked",
  "concept":"A shout that is sent to all bots when a bot is clicked."},
    {"title":"@onAnyBotPointerEnter",
  "concept":"A shout that is sent to all bots when the mouse cursor starts to hover over a bot."},
    {"title":"@onAnyBotPointerExit",
  "concept":"A shout that is sent to all bots when the mouse cursor stops hovering over a bot."},
    {"title":"@onAnyBotPointerDown",
  "concept":"A shout that is sent to all bots when the user starts clicking a bot."},
    {"title":"@onAnyBotPointerUp",
  "concept":"A shout that is sent to all bots when the user stops clicking a bot."},
    {"title":"@onChat",
  "concept":"A shout that is sent to all bots when the player sends a chat message. Chat messages can be sent when the player presses the Enter key while writing a message or by clicking/tapping the 'Send Message' button to the right of the chat bar."},
    {"title":"@onChatTyping",
  "concept":"A shout that is sent to all bots when the player changes the text in the chat bar. Only triggered when the chat bar is visible."},
    {"title":"@onFileUpload",
  "concept":"A shout that is sent to all bots when the user drags a file into the window."},
    {"title":"@onGridClick",
  "concept":"A shout that is sent to all bots when the user clicks on empty space."},
    {"title":"@onGridDown",
  "concept":"A shout that is sent to all bots when the user starts clicking on empty space."},
    {"title":"@onGridUp",
  "concept":"A shout that is sent to all bots when the user stops clicking on empty space."},
    {"title":"@onPortalChanged",
  "concept":"A shout that is sent to all bots when a portal changes on the config bot."},
    {"title":"@onBarcodeScanned",
  "concept":"A shout that is sent to all bots when the player scans a barcode."},
    {"title":"@onBarcodeScannerOpened",
  "concept":"A shout that is sent to all bots when the barcode scanner is opened."},
    {"title":"@onBarcodeScannerClosed",
  "concept":"A shout that is sent to all bots when the barcode scanner is closed."},
  {"title":"@onQRCodeScanned",
  "concept":"A shout that is sent to all bots when a QR Code is scanned."},
    {"title":"@onQRCodeScannerOpened",
  "concept":"A shout that is sent to all bots when the QR Code Scanner is opened."},
    {"title":"@onQRCodeScannerClosed",
  "concept":"A shout that is sent to all bots when the QR Code Scanner is closed."},
    {"title":"@onImageClassified",
  "concept":"A shout that is sent to all bots when an image has been classified."},
    {"title":"@onImageClassifierOpened",
  "concept":"A shout that is sent to all bots when the image classifier is opened."},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""},
    {"title":"",
  "concept":""}
  ]
}
