{
  "data":[
    {"title":"os.closeCircleWipe(options?)",
      "concept":"Causes a circular wipe animationi to close around the screen. This can be used to cover the grid portal while transitioning between scenes. Returns a promise that resolves when the animation has finished running. The promise will throw an exception if os.openCircleW9pe(options) is called while the animation is running. The first parameter is optional and is a Partial<OpenCircleWipeOptions> and is the options that should be used for the effect."},

    {"title":"os.openCircleWipe(options?)",
      "concept":"Causes the circular wipe animation to open around the screen. This can be used to reveal the grid portal after transitioning between screens. Returns a promise that resolves when the animation has finished running. The first parameter is optional and is a Partial<OpenCircleWipeOptions> and is the options that should be used for the effect."},

    {"title":"os.getCurrentDimension()",
      "concept":"Gets the dimension that is loaded into the #gridPortal portal. This function behaves exactly like os.getPortalDimension(portal) when given 'gridPortal'."},

    {"title":"os.getCurrentInst()",
      "concept":"Gets the inst that is loaded."},

    {"title":"os.getCurrentInstRecord()",
      "concept":"Gets the record that the inst was loaded from. Null if the inst is local or public."},

    {"title":"os.getDimensionalDepth(dimension:string)",
      "concept":"Gets the distance that the player bot is from the given dimension. Returns 0 if the player bot is in the dimension, 1 if the dimension is in a portal, and -1 if neither are true. The first parameter is a string and is the dimension to check for."},

    {"title":"os.getMenuDimension()",
      "concept":"Gets the dimension that is loaded into the #menuPortal portal. This function behaves exactly like os.getPortalDimension(portal) when given 'menuPortal'."},

    {"title":"os.getMiniPortalDimension()",
      "concept":"Gets the dimension that is loaded into the #miniGridPortal portal. This function behaves exactly like os.getPortalDimension(portal) when given 'miniGridPortal'."},

    {"title":"os.getPortalDimension(portal)",
      "concept":"Gets the dimension that is loaded into the given portal. If no dimension is loaded then null is returned. The first parameter is a string and is the portal that the dimension should be retrieved for."},

    {"title":"os.hasBotInMiniPortal(bots)",
      "concept":"Determines if the given bot is in the dimension that is currently loaded into the #miniGridPortal portal. The first parameter is (Bot | Bot[]) and is the bot or bots that should be checked."},

    {"title":"os.inSheet()",
      "concept":"Gets whether the player is viewing the sheetPortal."},

    {"title":"os.isInDimension(dimension)",
      "concept":"Gets whether the given dimension is loaded into the #gridPortal portal. The first parameter is a string and is the dimension to check for."},

    {"title":"os.exitFullscreenMode()",
      "concept":"Exits fullscreen mode."},

    {"title":"os.requestFullscreenMode()",
      "concept":"Attempts to enter fullscreen mode. Depending on which web browser the player is using, this might ask for permission to go fullscreen. Note that iPhones currentrly don't support fullscreen mode."},

    {"title":"os.goToDimension(dimension)",
      "concept":"Loads the given dimension into the #gridPortal portal. Triggers the @onPortalChanged shout for the gridPortal. The first parameter is a string and is the dimension that should be loaded."},

    {"title":"os.goToURL(url)",
      "concept":"Redirects the current tab to the given URL. Useful for sending the player to another webpage or ambient experience. The first parameter is a string and is the URL that the player should be sent to. Usually this is a website like https://example.com."},

    {"title":"os.openURL(url)",
      "concept":"Opens a new tab with the given URL. Useful for opening another webpage without redirecting the current tab. The first parameter is a string and is the URL that the player should be sent to. Usually this is a website like https://example.com."},

    {"title":"os.hideHtml()",
      "concept":"Closes the HTML popup model."},

    {"title":"os.showHtml(html)",
      "concept":"Shows some HTML to the player in a popup modal. This can be useful for loading a separate webpage or providing some formatted text. The first parameter is a string and is the HTML that should be shown to the user."},

    {"title":"os.getInputList()",
      "concept":"Gets the list of supported inputs. The returned strings can be used for the controller property in os.getInputState(controller, button) calls."},

    {"title":"os.getInputState(controller, button)",
      "concept":"Gets the state of the given button on the given controller. The first parameter is a string and is the name of the controller that should be checked. Possible values are: ~ mousePointer - The mouse. ~ leftPointer - The left controller. ~ rightPointer - The right controller. ~ keyboard - The keyboard. ~ touch - The touchscreen. The second parameter is a string and is the name of the button that you want to get the state of. Possible values are: ~ left - The left mouse button. Only available on the mouse pointer. On mobile devices this will also be the stat of the first touch. ~ right - The right mouse button. Only available on the mouse pointer. ~ middle - The middle mouse button. Only available on the mouse pointer. ~ primary - The primary controller button. Only available on the left and right pointers. ~ squeeze - The squeeze controller button. Only available on the left and right pointers. ~ Any Key - The button for the given key. Only available on the keyboard. ~ 0 - The first touch. Only available on the touchscreen. ~ 1 - The second touch. Only available on the touchscreen. ~ 2 - The third touch. Only available on the touchscreen. ~ 3 - The fourth touch. Only available on the touchscreen. ~ 5 - The fifth touch. Only available on the touchscreen."},

    {"title":"os.getCameraPosition(portal)",
      "concept":"Gets the 3D position that the player's camera is at in the given portal. The first parameter is a ('grid' | 'miniGrid') and is the portal that the camera position shouldbe retrieved for."},

    {"title":"os.getCameraRotation(portal)",
      "concept":"Gets the 3D rotation that the player's camera is at in the given portal. The first parameter is a ('grid' | 'miniGrid') and is the portal that the camera rotation should be retrieved for."},

    {"title":"os.getFocusPoint(portal)",
      "concept":"Gets the 3D position that the player's camera is focusing on in the given portal. This is the same point that is highlighted when #portalShowFocusPoint is enabled for a portal. The first parameter is a ('grid' | 'miniGrid') and is the portal that the camera focus point should be retrieved for."},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""},

    {"title":"",
      "concept":""}
  ]
}
